Repository: NiklasZeiler/myWebpage
Catalog: src/locale/messages.*.xlf
Languages: de

source: My Story
de: Meine Geschichte

source: Who am I?
de: Wer bin ich?

source: My name is Niklas Zeiler and I am a Front-End Developer.
de: Mein Name ist Niklas Zeiler und ich bin Frontend-Entwickler.

source: What are my skills?
de: Was sind meine Fähigkeiten?

source: During my further education, I learned various front-end technologies such as HTML5, CSS3 and JavaScript. The framework Angular and the associated TypeScript are other technologies that I can use. I can also handle techniques such as Responsive Web Design. With object orientation, I have programmed a small game. Thanks to experienced software developers, I was able to constantly improve my skills and find and fix errors in code.
de: Während meiner Weiterbildung habe ich verschiedene Frontend-Technologien wie HTML5, CSS3 und JavaScript gelernt. Das Framework Angular und das dazugehörige TypeScript sind weitere Technologien, die ich anwenden kann. Auch mit Techniken wie Responsive Web Design kann ich umgehen. Mit Objektorientierung habe ich ein kleines Spiel programmiert. Dank erfahrener Softwareentwickler konnte ich meine Fähigkeiten ständig verbessern und Fehler im Code finden und beheben.

source: Why did I become a software developer?
de: Warum bin ich Softwareentwickler geworden?

source: For me, becoming a software developer was the next logical step. After working in the automotive industry for seven years and becoming more and more interested in programming, I decided to turn my passion into a profession. Some time ago, I started reading up on programming with the help of the literature and wrote my first small projects. Soon I realized that I could do this with professional support. When I became aware of the Developer Academy in 2021, I decided to train there to become a software developer. During this training, I built various projects from responsive websites to small business apps in a team or on my own.
de: Für mich war es der nächste logische Schritt, Softwareentwickler zu werden. Nachdem ich sieben Jahre in der Automobilbranche gearbeitet hatte und mich immer mehr für das Programmieren interessierte, beschloss ich, meine Leidenschaft zum Beruf zu machen. Vor einiger Zeit begann ich, mich mit Hilfe von Literatur in die Programmierung einzulesen und schrieb meine ersten kleinen Projekte. Bald merkte ich, dass ich dies mit professioneller Unterstützung tun konnte. Als ich im Jahr 2021 auf die Developer Academy aufmerksam wurde, beschloss ich, mich dort zum Softwareentwickler ausbilden zu lassen. Während dieser Ausbildung habe ich verschiedene Projekte von responsiven Websites bis hin zu kleinen Business-Apps im Team oder alleine entwickelt.

source: What are my strengths?
de: Was sind meine Stärken?

source: Due to my previous work in a large car dealership, I can handle stress well and always find a solution. As a result, I also have a very high degree of initiative, which was additionally promoted by creating my projects. When working with several people, my ability to work in a team came in handy. My willingness to learn and my interest in solving new tasks are also among my strengths.
de: Durch meine frühere Tätigkeit in einem großen Autohaus kann ich gut mit Stress umgehen und finde immer eine Lösung. Dadurch habe ich auch ein sehr hohes Maß an Eigeninitiative, was durch das Erstellen meiner Projekte zusätzlich gefördert wurde. Bei der Arbeit mit mehreren Personen kam mir meine Teamfähigkeit zugute. Meine Lernbereitschaft und mein Interesse an der Lösung neuer Aufgaben zählen ebenfalls zu meinen Stärken.

source: About
de: Über

source: About me
de: Über mich

source: Hi, my name is Niklas, I am a frontend developer. Thanks to my further education, I have already been able to realize several projects and expand my knowledge through experienced software developers. From them, I have continuously received suggestions to improve my projects. I can create websites based on the latest web technologies, find problems myself and solve them. This includes frontend technologies like HTML5, CSS3, JavaScript, and techniques like Responsive Web Design. I have also created a few pages with the Angular framework.
de: Hallo, mein Name ist Niklas, ich bin Frontend-Entwickler. Dank meiner Weiterbildung konnte ich bereits mehrere Projekte realisieren und mein Wissen durch erfahrene Softwareentwickler erweitern. Von ihnen habe ich immer wieder Anregungen erhalten, um meine Projekte zu verbessern. Ich kann Webseiten auf Basis der neuesten Webtechnologien erstellen, Probleme selbst finden und lösen. Dazu gehören Frontend-Technologien wie HTML5, CSS3, JavaScript, und Techniken wie Responsive Web Design. Ich habe auch schon einige Seiten mit dem Angular-Framework erstellt.

source: Contact me
de: Kontaktiere mich

source: Contact me via the form below or by email to <br><a [href]="emailstring" target="_top">zeiler.niklas@outlook.com</a>
de: Kontaktiere mich über das untenstehende Formular oder per E-Mail an <br><a [href]="emailstring" target="_top">zeiler.niklas@outlook.com</a>

source: Please enter your name
de: Nitte gib deinen Namen ein

source: Please type your e-mail
de: Bitte gib deine E-Mail ein

source: Message
de: Nachricht

source: Please type your message here
de: Bitte gib deine Nachricht hier ein

source: Send mail
de: Senden

source: Through HTML I have gained insight into how easy it is to design the content of a website. Through my acquired knowledge and constant interest to expand this knowledge, I can develop a content-rich website for you with the help of HTML. Whether semantic markup, user-friendly web forms, or canvas elements are no problem for me.
de: Durch HTML habe ich einen Einblick gewonnen, wie einfach es ist, den Inhalt einer Website zu gestalten. Durch mein erworbenes Wissen und das ständige Interesse, dieses Wissen zu erweitern, kann ich mit Hilfe von HTML eine inhaltsreiche Website für Sie entwickeln. Ob semantisches Markup, benutzerfreundliche Webformulare oder Canvas-Elemente sind für mich kein Problem.

source: Cascading Style Sheets(CSS) had their beginnings in 1993. Since then CSS is in version CSS3 and has become the standard for designing, formatting, and aligning HTML elements. In frontend development, it is inevitable to work with CSS3 and therefore I create appealing and user-friendly websites for you.
de: Die Anfänge von Cascading Style Sheets(CSS) gehen auf das Jahr 1993 zurück. Inzwischen liegt CSS in der Version CSS3 vor und hat sich zum Standard für die Gestaltung, Formatierung und Ausrichtung von HTML-Elementen entwickelt. In der Frontend-Entwicklung ist es unumgänglich, mit CSS3 zu arbeiten und so erstelle ich für Sie ansprechende und benutzerfreundliche Webseiten.

source: As a frontend developer, you can't get around JavaScript these days if you want to make your website dynamic. Whether you want to evaluate user interactions, change content, reload or generate and thus expand the content. I would be happy to add the appropriate logic to your website to get a frictionless function of the website.
de: Als Frontend-Entwickler kommt man heute um JavaScript nicht mehr herum, wenn man seine Website dynamisch gestalten will. Ob Sie nun Nutzerinteraktionen auswerten, Inhalte ändern, nachladen oder generieren und damit den Inhalt erweitern wollen. Gerne füge ich Ihrer Website die entsprechende Logik hinzu, um eine reibungslose Funktion der Website zu erreichen.

source: I was able to gain experience with APIs (Application Programming Interface) during my further education. This allows commands, functions, protocols, and objects to be used by programmers to communicate with another system or to create software.
de: Während meiner Fortbildung konnte ich Erfahrungen mit APIs (Application Programming Interface) sammeln. Damit können Befehle, Funktionen, Protokolle und Objekte von Programmierern verwendet werden, um mit einem anderen System zu kommunizieren oder Software zu erstellen.

source: Due to the growing number of mobile devices, the interest in responsive websites is increasing. I have already gained some experience in this area, as I have adapted all my projects for a wide range of resolutions.
de: Aufgrund der wachsenden Zahl mobiler Geräte steigt das Interesse an responsiven Websites. Ich habe bereits einige Erfahrungen in diesem Bereich gesammelt, da ich alle meine Projekte für eine breite Palette von Auflösungen angepasst habe.

source: GitHub is the business card of a software developer. You can upload your code there and it is visible for everyone depending on the settings. I also uploaded my projects there. Even when I had to develop projects in a team, we worked with Github.
de: GitHub ist die Visitenkarte eines Softwareentwicklers. Man kann seinen Code dort hochladen und er ist je nach Einstellung für jeden sichtbar. Auch ich habe meine Projekte dort hochgeladen. Selbst als ich Projekte in einem Team entwickeln musste, haben wir mit Github gearbeitet.

source: Angular is a Typescript-based framework. Angular includes a lot of integrated libraries that cover different functions. I could develop projects with Angular, like my own website.
de: Angular ist ein auf Typescript basierendes Framework. Angular enthält eine Menge integrierter Bibliotheken, die verschiedene Funktionen abdecken. Ich könnte Projekte mit Angular entwickeln, wie meine eigene Website.

source: TypeScript is an extension of JavaScript and is used in the Angular framework. Thanks to my work with Angular I could also gain experience with TypeScript and learn how to use it.
de: TypeScript ist eine Erweiterung von JavaScript und wird im Angular-Framework verwendet. Dank meiner Arbeit mit Angular konnte ich auch Erfahrungen mit TypeScript sammeln und lernen, wie man es einsetzt.

source: Firebase is a platform that you can also use as a backend server. There you can create databases and access them from different devices. I have created a small card game that you can play online with your friends.
de: Firebase ist eine Plattform, die Sie auch als Backend-Server nutzen können. Dort können Sie Datenbanken erstellen und von verschiedenen Geräten aus darauf zugreifen. Ich habe ein kleines Kartenspiel erstellt, das Sie online mit Ihren Freunden spielen können.

source: Hi, <br> I am <span class="colored">Niklas</span>,<br> Front-End Developer
de: Hi, <br> ich bin <span class="colored">Niklas</span>,<br> Front-End Entwickler

source: Created my free logo at <a href="https://logomakr.com/">LogoMakr.com</a>
de: Kostenlos Logo greiert bei <a href="https://logomakr.com/">LogoMakr.com</a>

source: Skills
de: Fähigkeiten

source: Work
de: Arbeiten

source: About
de: Über

source: Contact
de: Kontakt

source: Imprint
de: Impressum

source: Privacy
de: Datenschutz

source: View
de: Anschauen

source: Lieferando recreated with JavaScript
de: Lieferandonachbau mit Javascript

source: Pokedex created with an API and JavaScript
de: Pokedex mit einer API und Javascript erstellt

source: Jump and run game written with JavaScript and object orientation
de: Jump&Run Spiel in Javascript und Objektorientierung

source: My own webpage
de: Meine eigene Webseite

source: Card game created with Angular and firebase
de: Kartenspiel mit Angular und Firebase

source: My work
de: Meine Arbeiten

source: Here you can find a small selection of my projects.<br> Please feel free to visit my <a routerLink="projects-solo">work</a> page to see more.
de: Hier findest du eine kleine Auswahl meiner Projekte.<br> Schaue gerne auf meiner <a routerLink="projects-solo">Arbeiten</a> Seite, um mehr zu sehen.

source: Mail sent
de: Mail gesendet

source: Thank you for your message. I will be in touch soon.
de: Danke für deine Nachricht. Ich melde mich bald.

source: Close
de: Schließen
